# На числовой прямой даны два отрезка: P=[35,55] и Q=[45,65].
# Определите наименьшую возможную длину отрезка A, при котором формулы
# (x ∈ P) → (x ∈ А)
# (x ∉ A) → (x ∉ Q)
# тождественно истинны, то есть принимают значение 1 при любом значении переменной х.

p1, p2, q1, q2 = 35, 55, 45, 65

P = [i / 10 for i in range(p1 * 10, p2 * 10 + 1)]
Q = [i / 10 for i in range(q1 * 10, q2 * 10 + 1)]

def f(x, A):
    return ((x in P) <= (x in A)) and ((x not in A) <= (x not in Q))

A = set()

for x in [i / 10 for i in range(34 * 10, 66 * 10)]:
    if not f(x, A):
        A.add(x)

print(sorted(A))

# [35; 65]
# Ответ: 65 - 35 = 30