# На числовой прямой даны два отрезка: P=[37,60] и Q=[40,77].
# Укажите наименьшую возможную длину такого отрезка A, что формула
# (x ∈ P) → (((x ∈ Q) ∧ (x ∉ A)) → (x ∉ P))
# тождественно истинна, то есть принимает значение 1 при любом значении переменной х.

p1, p2, q1, q2 = 37, 60, 40, 77

P = [i / 10 for i in range(p1 * 10, p2 * 10 + 1)]
Q = [i / 10 for i in range(q1 * 10, q2 * 10 + 1)]

def f(x, A):
    return (x in P) <= (((x in Q) and (x not in A)) <= (x not in P))

A = set()

for x in [i / 10 for i in range(36 * 10, 78 * 10)]:
    if not f(x, A):
        A.add(x)

print(sorted(A))

# [40; 60]
# Ответ: 60 - 40 = 20