# На числовой прямой даны два отрезка: P=[10,30] и Q=[25,55].
# Определите наибольшую возможную длину отрезка A, при котором формула
# (x ∈ A) → ((x ∈ P) ∨ (x ∈ Q))
# тождественно истинна, то есть принимает значение 1 при любом значении переменной х.

p1, p2, q1, q2 = 10, 30, 25, 55

P = [i / 10 for i in range(p1 * 10, p2 * 10 + 1)]
Q = [i / 10 for i in range(q1 * 10, q2 * 10 + 1)]

def f(x, A):
    return (x in A) <= ((x in P) or (x in Q))

A = set([i / 10 for i in range(9 * 10, 56 * 10)])

for x in [i / 10 for i in range(9 * 10, 56 * 10)]:
    if not f(x, A):
        A.remove(x)

print(sorted(A))

# [10, 55]
# Ответ: 55 - 10 - 45