# В файле электронной таблицы 9-170.xls в каждой строке содержатся шесть неотрицательных целых чисел. Определите
# количество строк таблицы, для которых выполнены оба условия:
# – в строке нет чисел, которые повторяются;
# – среднее арифметическое чисел строки не меньше медианы чисел строки.
# Примечание. Медиана — это число, которое находится в середине отсортированного набора чисел. Для четного количества
# чисел за медиану принимают полусумму двух стоящих в центре чисел. Так, для набора 1, 4, 6, 9 медиана равна 5.
#
# Ответ: 2097

