# Все четырехбуквенные слова, в составе которых могут быть только буквы П, Я, Т, Ь, Д, Н, Е, Й, записаны в
# алфавитном порядке и пронумерованы начиная с 1. Вот начало списка:
# 1. ДДДД
# 2. ДДДЕ
# 3. ДДДЙ
# 4. ДДДН
# 5. ДДДП
# 6. ДДДТ
# 7. ДДДЬ
# 8. ДДДЯ
# 9. ДДЕД
# ...
# Под каким номером в списке стоит последнее слово, которое не содержит ни одной гласной и все буквы в нем различны?
#
# Ответ:3428

# Алфавит 'ДЕЙНПТЬЯ'
#          01234567
#
# Наибольшим восьмеричным числом удовлетворяющим условиям является ЬТПН = 6543, в десятичной это 3427. Поскольку
# счет начинается с 1, то 3427 + 1 = 3428.
