# Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число m».
# На числовой прямой даны три отрезка: P = [257, 356], Q = [5, 600] и R = [59, 228]. Какова минимальная длина
# отрезка A, при котором формула
# ((x ∈ R) → (x ∈ A)) ∨ ((ДЕЛ(x, 3) → (x ∈ P)) → ((x ∈ Q) → (x ∈ A)))
#
# тождественно истинна, то есть принимает значение 1 при любом натуральном значении переменной х?
#
# Ответ: 168

p1, p2, q1, q2, r1, r2 = 257, 356, 5, 600, 59, 228

P = [i for i in range(p1, p2 + 1)]
Q = [i for i in range(q1, q2 + 1)]
R = [i for i in range(r1, r2 + 1)]
A = []

def d(n, m):
    return n % m == 0

def f(x):
    return ((x in R) <= (x in A)) or ((d(x, 3) <= (x in P)) <= ((x in Q) <= (x in A)))

for x in [i for i in range(4, 601)]:
    if not f(x):
        A.append(x)

print(f(60))
print(sorted(A))
